package JavaRush.JavaRush_Projects.Chat;

public class Help {
    /*
1) Server - основной класс сервера.
2) MessageType - enum, который отвечает за тип сообщений пересылаемых между клиентом и сервером.
3) Message - класс, отвечающий за пересылаемые сообщения.
4) Connection - класс соединения между клиентом и сервером.
5) ConsoleHelper - вспомогательный класс, для чтения или записи в консоль.
//Что можно добавить или улучшить:
//• Можно добавить поддержку приватных сообщений (когда сообщение отправляется не всем, а какому-то конкретному участнику).
//• Можно расширить возможности бота, попробовать научить его отвечать на простейшие вопросы или время от времени отправлять шутки.
//• Добавить возможность пересылки файлов между пользователями.
//• Добавить контекстное меню в графический клиент, например, для отправки приватного сообщения кому-то из списка участников.
//• Добавить раскраску сообщений в графическом клиенте в зависимости от отправителя.
//• Добавить блокировку сервером участников за что-либо, например, ненормативную лексику в сообщениях.
//• Добавить еще миллион фич и полезностей!

     */
}
